<!DOCTYPE HTML>
<html lang="ja" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>Vuex は何ですか？ | Table of Contents</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.2">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-prism/prism.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
    

        
    
    
    <link rel="next" href="./concepts.html" />
    
    
    <link rel="prev" href="./index.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="1"
        data-chapter-title="Vuex は何ですか？"
        data-filepath="intro.md"
        data-basepath="."
        data-revision="Fri Apr 08 2016 16:33:39 GMT-0400 (EDT)"
        data-innerlanguage="ja">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        はじめに
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="1" data-path="intro.html">
            
                
                    <a href="./intro.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        Vuex は何ですか？
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="concepts.html">
            
                
                    <a href="./concepts.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        中核概念
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="state.html">
            
                
                    <a href="./state.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        ステート
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="mutations.html">
            
                
                    <a href="./mutations.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        ミューテーション
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="actions.html">
            
                
                    <a href="./actions.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.3.</b>
                        
                        アクション
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3" data-path="data-flow.html">
            
                
                    <a href="./data-flow.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        データフロー
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="structure.html">
            
                
                    <a href="./structure.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        アプリケーションの構造
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="middlewares.html">
            
                
                    <a href="./middlewares.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        ミドルウェア
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="strict.html">
            
                
                    <a href="./strict.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        厳格モード
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="forms.html">
            
                
                    <a href="./forms.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        フォームのハンドリング
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="testing.html">
            
                
                    <a href="./testing.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        テスト
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="hot-reload.html">
            
                
                    <a href="./hot-reload.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        ホットリローディング
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="10" data-path="api.html">
            
                
                    <a href="./api.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        API リファレンス
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    で公開 GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >Table of Contents</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h2 id="vuex-&#x306F;&#x4F55;&#x3067;&#x3059;&#x304B;&#xFF1F;">Vuex &#x306F;&#x4F55;&#x3067;&#x3059;&#x304B;&#xFF1F;</h2>
<p>Vuex &#x306F; Vue.js &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x96C6;&#x4E2D;&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30A2;&#x30FC;&#x30AD;&#x30C6;&#x30AF;&#x30C1;&#x30E3;&#x3067;&#x3059;&#x3002;<a href="https://facebook.github.io/flux/" target="_blank">Flux</a> &#x3084; <a href="https://github.com/rackt/redux" target="_blank">Redux</a> &#x304B;&#x3089;&#x30A4;&#x30F3;&#x30B9;&#x30D4;&#x30EC;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5F97;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001; &#x7C21;&#x6613;&#x5316;&#x3055;&#x308C;&#x305F;&#x6982;&#x5FF5;&#x3001;&#x305D;&#x3057;&#x3066; Vue.js &#x30EA;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x9577;&#x6240;&#x3092;&#x5F97;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x7279;&#x5225;&#x306B;&#x8A2D;&#x8A08;&#x3055;&#x308C;&#x305F;&#x5B9F;&#x88C5;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<h2 id="&#x306A;&#x305C;&#x3053;&#x308C;&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3059;&#x308B;&#x306E;&#x3067;&#x3059;&#x304B;&#xFF1F;">&#x306A;&#x305C;&#x3053;&#x308C;&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3059;&#x308B;&#x306E;&#x3067;&#x3059;&#x304B;&#xFF1F;</h2>
<p>&#x3042;&#x306A;&#x305F;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x975E;&#x5E38;&#x306B;&#x5358;&#x7D14;&#x3067;&#x3042;&#x308B;&#x306A;&#x3089;&#x3070;&#x3001;&#x591A;&#x5206; Vuex &#x306F;&#x5FC5;&#x8981;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;&#x305D;&#x308C;&#x3092;&#x65E9;&#x307E;&#x3063;&#x3066;&#x9069;&#x7528;&#x3057;&#x306A;&#x3044;&#x3067;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x4E2D;&#x301C;&#x5927;&#x898F;&#x6A21;&#x306A; SPA &#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001;&#x3042;&#x306A;&#x305F;&#x306E; Vue &#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306E;&#x5916;&#x5074;&#x3067;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x3088;&#x308A;&#x3088;&#x3044;&#x69CB;&#x9020;&#x7269;&#x306B;&#x3059;&#x308B;&#x304B;&#x306B;&#x3064;&#x3044;&#x3066;&#x8003;&#x3048;&#x308B;&#x72B6;&#x6CC1;&#x306B;&#x906D;&#x9047;&#x3059;&#x308B;&#x6A5F;&#x4F1A;&#x3067;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F; Vuex &#x306E;&#x51FA;&#x756A;&#x3067;&#x3059;&#x3002;</p>
<p>Vue.js &#x3092;&#x5358;&#x72EC;&#x3066;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x304D;&#x3001;&#x3057;&#x3070;&#x3057;&#x3070;&#x3001;&#x79C1;&#x9054;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306E;&quot;&#x5185;&#x90E8;&quot;&#x72B6;&#x614B;&#x3092;&#x4FDD;&#x6301;&#x3057;&#x307E;&#x3059;&#x3002;&#x3064;&#x307E;&#x308A;&#x3001;&#x5404;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306F;&#x3001;&#x79C1;&#x9054;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x72B6;&#x614B;&#x306E;&#x4E00;&#x90E8;&#x3092;&#x6240;&#x6709;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x7D50;&#x679C;&#x3068;&#x3057;&#x3066;&#x72B6;&#x614B;&#x304C;&#x3042;&#x3089;&#x3086;&#x308B;&#x5834;&#x6240;&#x306B;&#x6563;&#x5728;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x6642;&#x3069;&#x304D;&#x72B6;&#x614B;&#x306E;&#x4E00;&#x90E8;&#x306F;&#x3001;&#x8907;&#x6570;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306B;&#x3088;&#x308A;&#x5171;&#x6709;&#x3055;&#x308C;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4E00;&#x822C;&#x7684;&#x306B;&#x898B;&#x3089;&#x308C;&#x308B;&#x7D4C;&#x9A13;&#x3068;&#x3057;&#x3066;&#x3001;&#x3042;&#x308B;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x304C;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x72B6;&#x614B;&#x3092;&#x4ED6;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306B;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&quot;&#x9001;&#x308D;&#x3046;&quot;&#x3068;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x306E;&#x554F;&#x984C;&#x306F;&#x3001;&#x5927;&#x898F;&#x6A21;&#x306A;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x30C4;&#x30EA;&#x30FC;&#x5185;&#x90E8;&#x306E;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x30D5;&#x30ED;&#x30FC;&#x306F;&#x3059;&#x3050;&#x306B;&#x8907;&#x96D1;&#x306B;&#x3067;&#x304D;&#x3001;&#x3057;&#x3070;&#x3057;&#x3070;&#x3046;&#x307E;&#x304F;&#x52D5;&#x4F5C;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x305D;&#x308C;&#x306B;&#x3064;&#x3044;&#x3066;&#x539F;&#x56E0;&#x3092;&#x8ABF;&#x67FB;&#x3059;&#x308B;&#x306E;&#x306F;&#x96E3;&#x3057;&#x3044;&#x3067;&#x3059;&#x3002;</p>
<p>&#x5927;&#x898F;&#x6A21;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x72B6;&#x614B;&#x3092;&#x5171;&#x6709;&#x3055;&#x305B;&#x308B;&#x305F;&#x3081;&#x306B;&#x512A;&#x308C;&#x305F;&#x5BFE;&#x51E6;&#x3068;&#x3057;&#x3066;&#x3001;<strong>&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306E;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x72B6;&#x614B;</strong>&#x3068;<strong>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30EC;&#x30D9;&#x30EB;&#x306E;&#x72B6;&#x614B;</strong>&#x3092;&#x533A;&#x5225;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x72B6;&#x614B;&#x306F;&#x7279;&#x5B9A;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306B;&#x5C5E;&#x3057;&#x3066;&#x3044;&#x307E;&#x305B;&#x3093;&#x304C;&#x3001;&#x79C1;&#x9054;&#x306E;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x306F;&#x30EA;&#x30A2;&#x30AF;&#x30C6;&#x30A3;&#x30D6;&#x306A; DOM &#x66F4;&#x65B0;&#x306E;&#x305F;&#x3081;&#x306B;&#x305D;&#x308C;&#x3092;&#x76E3;&#x8996;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;1 &#x3064;&#x306E;&#x5834;&#x6240;&#x3067;&#x305D;&#x308C;&#x3092;&#x96C6;&#x4E2D;&#x7684;&#x306B;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001;&#x3042;&#x308B;&#x30B3;&#x30F3;&#x30DD;&#x30FC;&#x30CD;&#x30F3;&#x30C8;&#x304C;&#x305D;&#x3053;&#x306B;&#x5C5E;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x3088;&#x308A;&#x3082;&#x5168;&#x3066;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x308B;&#x305F;&#x3081;&#x3001;&#x3082;&#x306F;&#x3084;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3042;&#x3061;&#x3053;&#x3061;&#x3092;&#x6E21;&#x3059;&#x5FC5;&#x8981;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x52A0;&#x3048;&#x3066;&#x3001;&#x79C1;&#x9054;&#x306F;&#x3001;&#x8A18;&#x9332;&#x3068;&#x72B6;&#x614B;&#x5909;&#x5316;&#x306E;&#x7406;&#x89E3;&#x3092;&#x5BB9;&#x6613;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x5168;&#x3066;&#x306E;&#x5909;&#x7570;&#x3092;&#x691C;&#x67FB;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x3001;&#x30BF;&#x30A4;&#x30E0;&#x30C8;&#x30E9;&#x30D9;&#x30EB;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x306E;&#x3088;&#x3046;&#x306A;&#x6D3E;&#x624B;&#x306A;&#x3082;&#x306E;&#x3082;&#x5B9F;&#x88C5;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p>
<p>Vuex &#x306F;&#x307E;&#x305F;&#x3001;&#x3069;&#x306E;&#x3088;&#x3046;&#x306B;&#x7570;&#x306A;&#x308B;&#x5834;&#x6240;&#x306B;&#x72B6;&#x614B;&#x7BA1;&#x7406;&#x30ED;&#x30B8;&#x30C3;&#x30AF;&#x3092;&#x5206;&#x96E2;&#x3059;&#x308B;&#x304B;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x610F;&#x898B;&#x3092;&#x5F37;&#x5236;&#x3057;&#x307E;&#x3059;&#x304C;&#x3001;&#x305D;&#x308C;&#x3067;&#x3082;&#x5B9F;&#x969B;&#x306E;&#x30B3;&#x30FC;&#x30C9;&#x69CB;&#x9020;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x5341;&#x5206;&#x306A;&#x67D4;&#x8EDF;&#x6027;&#x3092;&#x53EF;&#x80FD;&#x3057;&#x307E;&#x3059;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./index.html" class="navigation navigation-prev " aria-label="Previous page: はじめに"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./concepts.html" class="navigation navigation-next " aria-label="Next page: 中核概念"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-edit-link/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-github/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"edit-link":{"base":"https://github.com/vuejs/vuex/tree/master/docs","label":"Edit This Page"},"github":{"url":"https://github.com/vuejs/vuex/"},"prism":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
